snap.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-06 Mon 09:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Snap LXD</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="JUNJIE NAN" />
<link rel="stylesheet" type="text/css" href="css/org.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a> | 
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Snap LXD</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgad9d414">Snap and Lxd</a>
<ul>
<li><a href="#org5565342">Run lxd in Snap</a></li>
<li><a href="#orgb243b56">Launcn Lxd container</a></li>
<li><a href="#orgfea3175">Run snap inside Lxd Container</a></li>
<li><a href="#org61c24a3">Run Lxd inside Lxd Container</a></li>
<li><a href="#org12af5d1">Run Docker inside Lxd Container</a></li>
</ul>
</li>
<li><a href="#org9c9a707">Build Snap</a>
<ul>
<li><a href="#orge927375">Setup</a></li>
<li><a href="#org764487f"><span class="todo TODO">TODO</span> Build</a></li>
<li><a href="#orgaad8eae"><span class="todo TODO">TODO</span> Test</a></li>
</ul>
</li>
<li><a href="#orge4df037"><span class="todo TODO">TODO</span> Snap Store</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgad9d414" class="outline-2">
<h2 id="orgad9d414">Snap and Lxd</h2>
<div class="outline-text-2" id="text-orgad9d414">
<p>
You can use <code>snap</code> to run <code>lxd</code>, or the opposite. Inside <code>lxd</code> you
can run <code>docker</code>.
</p>

<div class="org-src-container">
<pre class="src src-artist">+----------+       +-----------+       +------------+        +-----------+
|          |       |           |       |            |        |           |
|    vm    +------&gt;|    snap   +------&gt;|     lxd    +-------&gt;|   docker  |
|          |       |           |       |            |        |           |
+----------+       +-----------+       +------+-----+        +-----------+
                         ^                    |
                         |                    |
                         +--------------------+
</pre>
</div>
</div>

<div id="outline-container-org5565342" class="outline-3">
<h3 id="org5565342">Run lxd in Snap</h3>
<div class="outline-text-3" id="text-org5565342">
<p>
By default ubuntu xenial with lxd and lxd client installed. You can
check this by running:
</p>

<div class="org-src-container">
<pre class="src src-sh">which lxd                       <span class="org-comment-delimiter"># </span><span class="org-comment">=&gt; /usr/bin/lxd</span>
which lxc                       <span class="org-comment-delimiter"># </span><span class="org-comment">=&gt; /usr/bin/lxc</span>
</pre>
</div>

<p>
The lxd in apt repo is very low. We need to switch to the lxd in
snap store:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">Uninstall existing lxd in ubuntu repo.</span>
apt-get purge -qq lxd lxd-client
<span class="org-comment-delimiter"># </span><span class="org-comment">Install lxd in snap</span>
snap install lxd
<span class="org-comment-delimiter"># </span><span class="org-comment">Check lxd and lxc</span>
which lxd                       <span class="org-comment-delimiter"># </span><span class="org-comment">=&gt; /snap/bin/lxd</span>
lxd --version                   <span class="org-comment-delimiter"># </span><span class="org-comment">=&gt; 3.3</span>
which lxc                       <span class="org-comment-delimiter"># </span><span class="org-comment">=&gt; /snap/bin/lxc</span>
lxc --version                   <span class="org-comment-delimiter"># </span><span class="org-comment">=&gt; 3.3</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Init lxd</span>
lxd init
<span class="org-comment-delimiter"># </span><span class="org-comment">Start lxd</span>
snap restart lxd
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb243b56" class="outline-3">
<h3 id="orgb243b56">Launcn Lxd container</h3>
<div class="outline-text-3" id="text-orgb243b56">
<p>
Now launch a vm like <code>lxc</code> container:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">List images</span>
snap image list ubuntu:xenial
<span class="org-comment-delimiter"># </span><span class="org-comment">Launch a container</span>
lxc launch ubuntu:xenial/amd64
<span class="org-comment-delimiter"># </span><span class="org-comment">List containers</span>
lxc list
<span class="org-comment-delimiter"># </span><span class="org-comment">exec bash in the container</span>
lxc exec steady-dingo bash
<span class="org-comment-delimiter"># </span><span class="org-comment">Now you can do anything in the container</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfea3175" class="outline-3">
<h3 id="orgfea3175">Run snap inside Lxd Container</h3>
<div class="outline-text-3" id="text-orgfea3175">
<p>
Snap as a container, can run <code>lxd</code> and launch <code>lxd</code>
container. Inside the <code>lxc</code> container, you can run <code>snap</code>
container, say to install go snap:
</p>
<div class="org-src-container">
<pre class="src src-sh">lxc exec steady-dingo bash
snap install go --classic
<span class="org-builtin">echo</span> <span class="org-string">'export GOPATH=/usr/local'</span> &gt;&gt; ~/.bashrc
apt-get install build-essential
cat &gt; ~/.netrc &lt;&lt;EOF
<span class="org-sh-heredoc">  your github toke  n</span>
<span class="org-sh-heredoc">EOF</span>
go get github.ibm.com/nanjj/ncatd
ncatd --version                 <span class="org-comment-delimiter"># </span><span class="org-comment">ncatd version 0.0.1</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org61c24a3" class="outline-3">
<h3 id="org61c24a3">Run Lxd inside Lxd Container</h3>
<div class="outline-text-3" id="text-org61c24a3">
<p>
Run <code>lxd</code> inside lxd container nesting:
</p>
<div class="org-src-container">
<pre class="src src-sh">lxc config set steady-dingo security.nesting true
lxc exec steady-dingo bash
apt-get purge -qq lxd lxd-client
snap install lxd
lxd init
lxc launch ubuntu:xenial/amd64
</pre>
</div>
</div>
</div>

<div id="outline-container-org12af5d1" class="outline-3">
<h3 id="org12af5d1">Run Docker inside Lxd Container</h3>
<div class="outline-text-3" id="text-org12af5d1">
<p>
With <code>security.nesting true</code>, run docker:
</p>

<div class="org-src-container">
<pre class="src src-sh">apt-get install docker.io
docker run hello-world
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9c9a707" class="outline-2">
<h2 id="org9c9a707">Build Snap</h2>
<div class="outline-text-2" id="text-org9c9a707">
</div>
<div id="outline-container-orge927375" class="outline-3">
<h3 id="orge927375">Setup</h3>
<div class="outline-text-3" id="text-orge927375">
<div class="org-src-container">
<pre class="src src-sh">apt install snapcraft build-essential git
snap install snapcraft --classic
</pre>
</div>
</div>
</div>

<div id="outline-container-org764487f" class="outline-3">
<h3 id="org764487f"><span class="todo TODO">TODO</span> Build</h3>
</div>

<div id="outline-container-orgaad8eae" class="outline-3">
<h3 id="orgaad8eae"><span class="todo TODO">TODO</span> Test</h3>
</div>
</div>

<div id="outline-container-orge4df037" class="outline-2">
<h2 id="orge4df037"><span class="todo TODO">TODO</span> Snap Store</h2>
<div class="outline-text-2" id="text-orge4df037">
<p>
Here we may need to write a snapstore for our own use.
</p>
</div>
</div>
</div>
</body>
</html>
